In [ ]:
%load_ext sql

In [ ]:
%sql postgresql://student:student123@127.0.0.1/sparkifydb

In [3]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('0', Decimal('1541721977796'), '42', 'paid', None, None, 275, 'New York-Newark-Jersey City, NY-NJ-PA', '"Mozilla/5.0 (Windows NT 6.3; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 ('1', Decimal('1541722186796'), '42', 'paid', None, None, 275, 'New York-Newark-Jersey City, NY-NJ-PA', '"Mozilla/5.0 (Windows NT 6.3; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 ('2', Decimal('1541722347796'), '42', 'paid', None, None, 275, 'New York-Newark-Jersey City, NY-NJ-PA', '"Mozilla/5.0 (Windows NT 6.3; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 ('3', Decimal('1541722492796'), '42', 'paid', None, None, 275, 'New York-Newark-Jersey City, NY-NJ-PA', '"Mozilla/5.0 (Windows NT 6.3; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 ('4', Decimal('1541722664796'), '42', 'paid', None, None, 275, 'New York-Newark-Jersey City, NY-NJ-PA', '"Mozilla/5.0 (Windows NT 6.3; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"')]

In [4]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('42', 'Harper', 'Barrett', 'M', 'paid'),
 ('49', 'Chloe', 'Cuevas', 'F', 'free'),
 ('6', 'Cecilia', 'Owens', 'F', 'free'),
 ('24', 'Layla', 'Griffin', 'F', 'paid'),
 ('80', 'Tegan', 'Levine', 'F', 'paid')]

In [5]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('SONHOTT12A8C13493C', 'AR7G5I41187FB4CE6C', 'Something Girls', 1982, Decimal('233.40363')),
 ('SOHKNRJ12A6701D1F8', 'AR10USD1187B99F3F1', 'Drop of Rain', 0, Decimal('189.57016')),
 ('SOUDSGM12AC9618304', 'ARNTLGG11E2835DDB9', 'Insatiable (Instrumental Version)', 0, Decimal('266.39628')),
 ('SOCIWDW12A8C13D406', 'ARMJAGH1187FB546F3', 'Soul Deep', 1969, Decimal('148.03546')),
 ('SOFSOCN12A8C143F5D', 'ARXR32B1187FB57099', 'Face the Ashes', 2007, Decimal('209.60608'))]

In [6]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('AR7G5I41187FB4CE6C', 'Adam Ant', 'London, England', 'NaN', 'NaN'),
 ('AR10USD1187B99F3F1', 'Tweeterfriendly Music', 'Burlington, Ontario, Canada', 'NaN', 'NaN'),
 ('ARNTLGG11E2835DDB9', 'Clp', '', 'NaN', 'NaN'),
 ('ARMJAGH1187FB546F3', 'The Box Tops', 'Memphis, TN', '35.14968', '-90.04892'),
 ('ARXR32B1187FB57099', 'Gob', '', 'NaN', 'NaN')]

In [7]:
%sql SELECT * FROM times LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(Decimal('1541721977796'), 0, 9, 45, 11, 2018, 4),
 (Decimal('1541722186796'), 0, 9, 45, 11, 2018, 4),
 (Decimal('1541722347796'), 0, 9, 45, 11, 2018, 4),
 (Decimal('1541722492796'), 0, 9, 45, 11, 2018, 4),
 (Decimal('1541722664796'), 0, 9, 45, 11, 2018, 4)]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).